remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/timer.h
/**
 * \file
 *
 * \brief Component description for TIMER
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_TIMER_COMPONENT_
#define _SAMB11_TIMER_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR TIMER */
/* ========================================================================== */
/** \addtogroup SAMB11_TIMER ARM General Purpose Timer 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define TIMER_T11234
#define REV_TIMER                        0x100

/* -------- TIMER_CTRL : (TIMER Offset: 0x00) (R/W 8) Timer Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ENABLE:1;                  /**< bit:      0  Enable Timer Operation                   */
    uint8_t  EXTERNAL_INPUT_ENABLE:1;   /**< bit:      1  Select external input as enable          */
    uint8_t  EXTERNAL_INPUT_CLOCK:1;    /**< bit:      2  Select external input as clock           */
    uint8_t  INTERRUPT_ENABLE:1;        /**< bit:      3  Enable Timer Interrupt                   */
    uint8_t  :4;                        /**< bit:   4..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_CTRL_OFFSET                   0x00                                          /**<  (TIMER_CTRL) Timer Control  Offset */
#define TIMER_CTRL_RESETVALUE               0x00u                                         /**<  (TIMER_CTRL) Timer Control  Reset Value */

#define TIMER_CTRL_ENABLE_Pos               0                                              /**< (TIMER_CTRL) Enable Timer Operation Position */
#define TIMER_CTRL_ENABLE_Msk               (0x1u << TIMER_CTRL_ENABLE_Pos)                /**< (TIMER_CTRL) Enable Timer Operation Mask */
#define TIMER_CTRL_ENABLE                   TIMER_CTRL_ENABLE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use TIMER_CTRL_ENABLE_Msk instead */
#define TIMER_CTRL_EXTERNAL_INPUT_ENABLE_Pos 1                                              /**< (TIMER_CTRL) Select external input as enable Position */
#define TIMER_CTRL_EXTERNAL_INPUT_ENABLE_Msk (0x1u << TIMER_CTRL_EXTERNAL_INPUT_ENABLE_Pos)  /**< (TIMER_CTRL) Select external input as enable Mask */
#define TIMER_CTRL_EXTERNAL_INPUT_ENABLE    TIMER_CTRL_EXTERNAL_INPUT_ENABLE_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use TIMER_CTRL_EXTERNAL_INPUT_ENABLE_Msk instead */
#define TIMER_CTRL_EXTERNAL_INPUT_CLOCK_Pos 2                                              /**< (TIMER_CTRL) Select external input as clock Position */
#define TIMER_CTRL_EXTERNAL_INPUT_CLOCK_Msk (0x1u << TIMER_CTRL_EXTERNAL_INPUT_CLOCK_Pos)  /**< (TIMER_CTRL) Select external input as clock Mask */
#define TIMER_CTRL_EXTERNAL_INPUT_CLOCK     TIMER_CTRL_EXTERNAL_INPUT_CLOCK_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use TIMER_CTRL_EXTERNAL_INPUT_CLOCK_Msk instead */
#define TIMER_CTRL_INTERRUPT_ENABLE_Pos     3                                              /**< (TIMER_CTRL) Enable Timer Interrupt Position */
#define TIMER_CTRL_INTERRUPT_ENABLE_Msk     (0x1u << TIMER_CTRL_INTERRUPT_ENABLE_Pos)      /**< (TIMER_CTRL) Enable Timer Interrupt Mask */
#define TIMER_CTRL_INTERRUPT_ENABLE         TIMER_CTRL_INTERRUPT_ENABLE_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use TIMER_CTRL_INTERRUPT_ENABLE_Msk instead */
#define TIMER_CTRL_MASK                     0x0Fu                                          /**< \deprecated (TIMER_CTRL) Register MASK  (Use TIMER_CTRL_Msk instead)  */
#define TIMER_CTRL_Msk                      0x0Fu                                          /**< (TIMER_CTRL) Register Mask  */

/* -------- TIMER_VALUE : (TIMER Offset: 0x04) (R/W 32) Current Value -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t VALUE:32;                  /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TIMER_VALUE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_VALUE_OFFSET                  0x04                                          /**<  (TIMER_VALUE) Current Value  Offset */
#define TIMER_VALUE_RESETVALUE              0x00u                                         /**<  (TIMER_VALUE) Current Value  Reset Value */

#define TIMER_VALUE_VALUE_Pos               0                                              /**< (TIMER_VALUE)  Position */
#define TIMER_VALUE_VALUE_Msk               (0xFFFFFFFFu << TIMER_VALUE_VALUE_Pos)         /**< (TIMER_VALUE)  Mask */
#define TIMER_VALUE_VALUE(value)            (TIMER_VALUE_VALUE_Msk & ((value) << TIMER_VALUE_VALUE_Pos))
#define TIMER_VALUE_MASK                    0xFFFFFFFFu                                    /**< \deprecated (TIMER_VALUE) Register MASK  (Use TIMER_VALUE_Msk instead)  */
#define TIMER_VALUE_Msk                     0xFFFFFFFFu                                    /**< (TIMER_VALUE) Register Mask  */

