remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/timer.h
/* -------- TIMER_RELOAD : (TIMER Offset: 0x08) (R/W 32) Reload Value -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RELOAD:32;                 /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} TIMER_RELOAD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_RELOAD_OFFSET                 0x08                                          /**<  (TIMER_RELOAD) Reload Value  Offset */
#define TIMER_RELOAD_RESETVALUE             0x00u                                         /**<  (TIMER_RELOAD) Reload Value  Reset Value */

#define TIMER_RELOAD_RELOAD_Pos             0                                              /**< (TIMER_RELOAD)  Position */
#define TIMER_RELOAD_RELOAD_Msk             (0xFFFFFFFFu << TIMER_RELOAD_RELOAD_Pos)       /**< (TIMER_RELOAD)  Mask */
#define TIMER_RELOAD_RELOAD(value)          (TIMER_RELOAD_RELOAD_Msk & ((value) << TIMER_RELOAD_RELOAD_Pos))
#define TIMER_RELOAD_MASK                   0xFFFFFFFFu                                    /**< \deprecated (TIMER_RELOAD) Register MASK  (Use TIMER_RELOAD_Msk instead)  */
#define TIMER_RELOAD_Msk                    0xFFFFFFFFu                                    /**< (TIMER_RELOAD) Register Mask  */

/* -------- TIMER_INTSTATUSCLEAR : (TIMER Offset: 0x0c) (R/W 8) Timer Interrupt, write 1 to clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  INTSTATUSCLEAR:1;          /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_INTSTATUSCLEAR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_INTSTATUSCLEAR_OFFSET         0x0C                                          /**<  (TIMER_INTSTATUSCLEAR) Timer Interrupt, write 1 to clear  Offset */
#define TIMER_INTSTATUSCLEAR_RESETVALUE     0x00u                                         /**<  (TIMER_INTSTATUSCLEAR) Timer Interrupt, write 1 to clear  Reset Value */

#define TIMER_INTSTATUSCLEAR_INTSTATUSCLEAR_Pos 0                                              /**< (TIMER_INTSTATUSCLEAR)  Position */
#define TIMER_INTSTATUSCLEAR_INTSTATUSCLEAR_Msk (0x1u << TIMER_INTSTATUSCLEAR_INTSTATUSCLEAR_Pos)  /**< (TIMER_INTSTATUSCLEAR)  Mask */
#define TIMER_INTSTATUSCLEAR_INTSTATUSCLEAR TIMER_INTSTATUSCLEAR_INTSTATUSCLEAR_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use TIMER_INTSTATUSCLEAR_INTSTATUSCLEAR_Msk instead */
#define TIMER_INTSTATUSCLEAR_MASK           0x01u                                          /**< \deprecated (TIMER_INTSTATUSCLEAR) Register MASK  (Use TIMER_INTSTATUSCLEAR_Msk instead)  */
#define TIMER_INTSTATUSCLEAR_Msk            0x01u                                          /**< (TIMER_INTSTATUSCLEAR) Register Mask  */

/* -------- TIMER_PID4 : (TIMER Offset: 0xfd0) (R/ 8) Peripheral ID Register 4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_C_CODE:4;           /**< bit:   0..3  JEP 106 C Code                           */
    uint8_t  BLOCK_COUNT:4;             /**< bit:   4..7  Block Count                              */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_PID4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_PID4_OFFSET                   0xFD0                                         /**<  (TIMER_PID4) Peripheral ID Register 4  Offset */
#define TIMER_PID4_RESETVALUE               0x04u                                         /**<  (TIMER_PID4) Peripheral ID Register 4  Reset Value */

#define TIMER_PID4_JEP106_C_CODE_Pos        0                                              /**< (TIMER_PID4) JEP 106 C Code Position */
#define TIMER_PID4_JEP106_C_CODE_Msk        (0xFu << TIMER_PID4_JEP106_C_CODE_Pos)         /**< (TIMER_PID4) JEP 106 C Code Mask */
#define TIMER_PID4_JEP106_C_CODE(value)     (TIMER_PID4_JEP106_C_CODE_Msk & ((value) << TIMER_PID4_JEP106_C_CODE_Pos))
#define TIMER_PID4_BLOCK_COUNT_Pos          4                                              /**< (TIMER_PID4) Block Count Position */
#define TIMER_PID4_BLOCK_COUNT_Msk          (0xFu << TIMER_PID4_BLOCK_COUNT_Pos)           /**< (TIMER_PID4) Block Count Mask */
#define TIMER_PID4_BLOCK_COUNT(value)       (TIMER_PID4_BLOCK_COUNT_Msk & ((value) << TIMER_PID4_BLOCK_COUNT_Pos))
#define TIMER_PID4_MASK                     0xFFu                                          /**< \deprecated (TIMER_PID4) Register MASK  (Use TIMER_PID4_Msk instead)  */
#define TIMER_PID4_Msk                      0xFFu                                          /**< (TIMER_PID4) Register Mask  */

/* -------- TIMER_PID5 : (TIMER Offset: 0xfd4) (R/ 8) Peripheral ID Register 5 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PID5:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_PID5_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_PID5_OFFSET                   0xFD4                                         /**<  (TIMER_PID5) Peripheral ID Register 5  Offset */
#define TIMER_PID5_RESETVALUE               0x00u                                         /**<  (TIMER_PID5) Peripheral ID Register 5  Reset Value */

