remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/timer.h
#define TIMER_PID5_PID5_Pos                 0                                              /**< (TIMER_PID5)  Position */
#define TIMER_PID5_PID5_Msk                 (0xFFu << TIMER_PID5_PID5_Pos)                 /**< (TIMER_PID5)  Mask */
#define TIMER_PID5_PID5(value)              (TIMER_PID5_PID5_Msk & ((value) << TIMER_PID5_PID5_Pos))
#define TIMER_PID5_MASK                     0xFFu                                          /**< \deprecated (TIMER_PID5) Register MASK  (Use TIMER_PID5_Msk instead)  */
#define TIMER_PID5_Msk                      0xFFu                                          /**< (TIMER_PID5) Register Mask  */

/* -------- TIMER_PID6 : (TIMER Offset: 0xfd8) (R/ 8) Peripheral ID Register 6 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PID6:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_PID6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_PID6_OFFSET                   0xFD8                                         /**<  (TIMER_PID6) Peripheral ID Register 6  Offset */
#define TIMER_PID6_RESETVALUE               0x00u                                         /**<  (TIMER_PID6) Peripheral ID Register 6  Reset Value */

#define TIMER_PID6_PID6_Pos                 0                                              /**< (TIMER_PID6)  Position */
#define TIMER_PID6_PID6_Msk                 (0xFFu << TIMER_PID6_PID6_Pos)                 /**< (TIMER_PID6)  Mask */
#define TIMER_PID6_PID6(value)              (TIMER_PID6_PID6_Msk & ((value) << TIMER_PID6_PID6_Pos))
#define TIMER_PID6_MASK                     0xFFu                                          /**< \deprecated (TIMER_PID6) Register MASK  (Use TIMER_PID6_Msk instead)  */
#define TIMER_PID6_Msk                      0xFFu                                          /**< (TIMER_PID6) Register Mask  */

/* -------- TIMER_PID7 : (TIMER Offset: 0xfdc) (R/ 8) Peripheral ID Register 7 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PID7:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_PID7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_PID7_OFFSET                   0xFDC                                         /**<  (TIMER_PID7) Peripheral ID Register 7  Offset */
#define TIMER_PID7_RESETVALUE               0x00u                                         /**<  (TIMER_PID7) Peripheral ID Register 7  Reset Value */

#define TIMER_PID7_PID7_Pos                 0                                              /**< (TIMER_PID7)  Position */
#define TIMER_PID7_PID7_Msk                 (0xFFu << TIMER_PID7_PID7_Pos)                 /**< (TIMER_PID7)  Mask */
#define TIMER_PID7_PID7(value)              (TIMER_PID7_PID7_Msk & ((value) << TIMER_PID7_PID7_Pos))
#define TIMER_PID7_MASK                     0xFFu                                          /**< \deprecated (TIMER_PID7) Register MASK  (Use TIMER_PID7_Msk instead)  */
#define TIMER_PID7_Msk                      0xFFu                                          /**< (TIMER_PID7) Register Mask  */

/* -------- TIMER_PID0 : (TIMER Offset: 0xfe0) (R/ 8) Peripheral ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:8;             /**< bit:   0..7  Part Number Bits 7:0                     */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_PID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_PID0_OFFSET                   0xFE0                                         /**<  (TIMER_PID0) Peripheral ID Register 0  Offset */
#define TIMER_PID0_RESETVALUE               0x22u                                         /**<  (TIMER_PID0) Peripheral ID Register 0  Reset Value */

#define TIMER_PID0_PART_NUMBER_Pos          0                                              /**< (TIMER_PID0) Part Number Bits 7:0 Position */
#define TIMER_PID0_PART_NUMBER_Msk          (0xFFu << TIMER_PID0_PART_NUMBER_Pos)          /**< (TIMER_PID0) Part Number Bits 7:0 Mask */
#define TIMER_PID0_PART_NUMBER(value)       (TIMER_PID0_PART_NUMBER_Msk & ((value) << TIMER_PID0_PART_NUMBER_Pos))
#define TIMER_PID0_MASK                     0xFFu                                          /**< \deprecated (TIMER_PID0) Register MASK  (Use TIMER_PID0_Msk instead)  */
#define TIMER_PID0_Msk                      0xFFu                                          /**< (TIMER_PID0) Register Mask  */

/* -------- TIMER_PID1 : (TIMER Offset: 0xfe4) (R/ 8) Peripheral ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:4;             /**< bit:   0..3  Part Number Bits 11:8                    */
    uint8_t  JEP106_ID_3_0:4;           /**< bit:   4..7  JEP106 ID Bits 3:0                       */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_PID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_PID1_OFFSET                   0xFE4                                         /**<  (TIMER_PID1) Peripheral ID Register 1  Offset */
#define TIMER_PID1_RESETVALUE               0xB8u                                         /**<  (TIMER_PID1) Peripheral ID Register 1  Reset Value */

#define TIMER_PID1_PART_NUMBER_Pos          0                                              /**< (TIMER_PID1) Part Number Bits 11:8 Position */
#define TIMER_PID1_PART_NUMBER_Msk          (0xFu << TIMER_PID1_PART_NUMBER_Pos)           /**< (TIMER_PID1) Part Number Bits 11:8 Mask */
#define TIMER_PID1_PART_NUMBER(value)       (TIMER_PID1_PART_NUMBER_Msk & ((value) << TIMER_PID1_PART_NUMBER_Pos))
#define TIMER_PID1_JEP106_ID_3_0_Pos        4                                              /**< (TIMER_PID1) JEP106 ID Bits 3:0 Position */
#define TIMER_PID1_JEP106_ID_3_0_Msk        (0xFu << TIMER_PID1_JEP106_ID_3_0_Pos)         /**< (TIMER_PID1) JEP106 ID Bits 3:0 Mask */
#define TIMER_PID1_JEP106_ID_3_0(value)     (TIMER_PID1_JEP106_ID_3_0_Msk & ((value) << TIMER_PID1_JEP106_ID_3_0_Pos))
#define TIMER_PID1_MASK                     0xFFu                                          /**< \deprecated (TIMER_PID1) Register MASK  (Use TIMER_PID1_Msk instead)  */
#define TIMER_PID1_Msk                      0xFFu                                          /**< (TIMER_PID1) Register Mask  */

