remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/timer.h
/* -------- TIMER_PID2 : (TIMER Offset: 0xfe8) (R/ 8) Peripheral ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_ID_6_4:3;           /**< bit:   0..2  JEP106 ID Bits 6:4                       */
    uint8_t  JEDEC_USED:1;              /**< bit:      3  JEDEC Used                               */
    uint8_t  REVISION:4;                /**< bit:   4..7  Revision                                 */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_PID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_PID2_OFFSET                   0xFE8                                         /**<  (TIMER_PID2) Peripheral ID Register 2  Offset */
#define TIMER_PID2_RESETVALUE               0x1Bu                                         /**<  (TIMER_PID2) Peripheral ID Register 2  Reset Value */

#define TIMER_PID2_JEP106_ID_6_4_Pos        0                                              /**< (TIMER_PID2) JEP106 ID Bits 6:4 Position */
#define TIMER_PID2_JEP106_ID_6_4_Msk        (0x7u << TIMER_PID2_JEP106_ID_6_4_Pos)         /**< (TIMER_PID2) JEP106 ID Bits 6:4 Mask */
#define TIMER_PID2_JEP106_ID_6_4(value)     (TIMER_PID2_JEP106_ID_6_4_Msk & ((value) << TIMER_PID2_JEP106_ID_6_4_Pos))
#define TIMER_PID2_JEDEC_USED_Pos           3                                              /**< (TIMER_PID2) JEDEC Used Position */
#define TIMER_PID2_JEDEC_USED_Msk           (0x1u << TIMER_PID2_JEDEC_USED_Pos)            /**< (TIMER_PID2) JEDEC Used Mask */
#define TIMER_PID2_JEDEC_USED               TIMER_PID2_JEDEC_USED_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use TIMER_PID2_JEDEC_USED_Msk instead */
#define TIMER_PID2_REVISION_Pos             4                                              /**< (TIMER_PID2) Revision Position */
#define TIMER_PID2_REVISION_Msk             (0xFu << TIMER_PID2_REVISION_Pos)              /**< (TIMER_PID2) Revision Mask */
#define TIMER_PID2_REVISION(value)          (TIMER_PID2_REVISION_Msk & ((value) << TIMER_PID2_REVISION_Pos))
#define TIMER_PID2_MASK                     0xFFu                                          /**< \deprecated (TIMER_PID2) Register MASK  (Use TIMER_PID2_Msk instead)  */
#define TIMER_PID2_Msk                      0xFFu                                          /**< (TIMER_PID2) Register Mask  */

/* -------- TIMER_PID3 : (TIMER Offset: 0xfec) (R/ 8) Peripheral ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CUSTOMER_MOD_NUMBER:4;     /**< bit:   0..3  Customer Modification Number             */
    uint8_t  ECO_REV_NUMBER:4;          /**< bit:   4..7  ECO Revision Number                      */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_PID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_PID3_OFFSET                   0xFEC                                         /**<  (TIMER_PID3) Peripheral ID Register 3  Offset */
#define TIMER_PID3_RESETVALUE               0x00u                                         /**<  (TIMER_PID3) Peripheral ID Register 3  Reset Value */

#define TIMER_PID3_CUSTOMER_MOD_NUMBER_Pos  0                                              /**< (TIMER_PID3) Customer Modification Number Position */
#define TIMER_PID3_CUSTOMER_MOD_NUMBER_Msk  (0xFu << TIMER_PID3_CUSTOMER_MOD_NUMBER_Pos)   /**< (TIMER_PID3) Customer Modification Number Mask */
#define TIMER_PID3_CUSTOMER_MOD_NUMBER(value) (TIMER_PID3_CUSTOMER_MOD_NUMBER_Msk & ((value) << TIMER_PID3_CUSTOMER_MOD_NUMBER_Pos))
#define TIMER_PID3_ECO_REV_NUMBER_Pos       4                                              /**< (TIMER_PID3) ECO Revision Number Position */
#define TIMER_PID3_ECO_REV_NUMBER_Msk       (0xFu << TIMER_PID3_ECO_REV_NUMBER_Pos)        /**< (TIMER_PID3) ECO Revision Number Mask */
#define TIMER_PID3_ECO_REV_NUMBER(value)    (TIMER_PID3_ECO_REV_NUMBER_Msk & ((value) << TIMER_PID3_ECO_REV_NUMBER_Pos))
#define TIMER_PID3_MASK                     0xFFu                                          /**< \deprecated (TIMER_PID3) Register MASK  (Use TIMER_PID3_Msk instead)  */
#define TIMER_PID3_Msk                      0xFFu                                          /**< (TIMER_PID3) Register Mask  */

/* -------- TIMER_CID0 : (TIMER Offset: 0xff0) (R/ 8) Component ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CID0:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_CID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_CID0_OFFSET                   0xFF0                                         /**<  (TIMER_CID0) Component ID Register 0  Offset */
#define TIMER_CID0_RESETVALUE               0x0Du                                         /**<  (TIMER_CID0) Component ID Register 0  Reset Value */

#define TIMER_CID0_CID0_Pos                 0                                              /**< (TIMER_CID0)  Position */
#define TIMER_CID0_CID0_Msk                 (0xFFu << TIMER_CID0_CID0_Pos)                 /**< (TIMER_CID0)  Mask */
#define TIMER_CID0_CID0(value)              (TIMER_CID0_CID0_Msk & ((value) << TIMER_CID0_CID0_Pos))
#define TIMER_CID0_MASK                     0xFFu                                          /**< \deprecated (TIMER_CID0) Register MASK  (Use TIMER_CID0_Msk instead)  */
#define TIMER_CID0_Msk                      0xFFu                                          /**< (TIMER_CID0) Register Mask  */

/* -------- TIMER_CID1 : (TIMER Offset: 0xff4) (R/ 8) Component ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CID1:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_CID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

