remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/timer.h
#define TIMER_CID1_OFFSET                   0xFF4                                         /**<  (TIMER_CID1) Component ID Register 1  Offset */
#define TIMER_CID1_RESETVALUE               0xF0u                                         /**<  (TIMER_CID1) Component ID Register 1  Reset Value */

#define TIMER_CID1_CID1_Pos                 0                                              /**< (TIMER_CID1)  Position */
#define TIMER_CID1_CID1_Msk                 (0xFFu << TIMER_CID1_CID1_Pos)                 /**< (TIMER_CID1)  Mask */
#define TIMER_CID1_CID1(value)              (TIMER_CID1_CID1_Msk & ((value) << TIMER_CID1_CID1_Pos))
#define TIMER_CID1_MASK                     0xFFu                                          /**< \deprecated (TIMER_CID1) Register MASK  (Use TIMER_CID1_Msk instead)  */
#define TIMER_CID1_Msk                      0xFFu                                          /**< (TIMER_CID1) Register Mask  */

/* -------- TIMER_CID2 : (TIMER Offset: 0xff8) (R/ 8) Component ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CID2:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_CID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_CID2_OFFSET                   0xFF8                                         /**<  (TIMER_CID2) Component ID Register 2  Offset */
#define TIMER_CID2_RESETVALUE               0x05u                                         /**<  (TIMER_CID2) Component ID Register 2  Reset Value */

#define TIMER_CID2_CID2_Pos                 0                                              /**< (TIMER_CID2)  Position */
#define TIMER_CID2_CID2_Msk                 (0xFFu << TIMER_CID2_CID2_Pos)                 /**< (TIMER_CID2)  Mask */
#define TIMER_CID2_CID2(value)              (TIMER_CID2_CID2_Msk & ((value) << TIMER_CID2_CID2_Pos))
#define TIMER_CID2_MASK                     0xFFu                                          /**< \deprecated (TIMER_CID2) Register MASK  (Use TIMER_CID2_Msk instead)  */
#define TIMER_CID2_Msk                      0xFFu                                          /**< (TIMER_CID2) Register Mask  */

/* -------- TIMER_CID3 : (TIMER Offset: 0xffc) (R/ 8) Component ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CID3:8;                    /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} TIMER_CID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TIMER_CID3_OFFSET                   0xFFC                                         /**<  (TIMER_CID3) Component ID Register 3  Offset */
#define TIMER_CID3_RESETVALUE               0xB1u                                         /**<  (TIMER_CID3) Component ID Register 3  Reset Value */

#define TIMER_CID3_CID3_Pos                 0                                              /**< (TIMER_CID3)  Position */
#define TIMER_CID3_CID3_Msk                 (0xFFu << TIMER_CID3_CID3_Pos)                 /**< (TIMER_CID3)  Mask */
#define TIMER_CID3_CID3(value)              (TIMER_CID3_CID3_Msk & ((value) << TIMER_CID3_CID3_Pos))
#define TIMER_CID3_MASK                     0xFFu                                          /**< \deprecated (TIMER_CID3) Register MASK  (Use TIMER_CID3_Msk instead)  */
#define TIMER_CID3_Msk                      0xFFu                                          /**< (TIMER_CID3) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief TIMER hardware registers */
typedef struct {  /* ARM General Purpose Timer */
  RwReg8  CTRL;           /**< (TIMER Offset: 0x00) Timer Control */
  __I  uint8_t  Reserved1[3];
  RwReg   VALUE;          /**< (TIMER Offset: 0x04) Current Value */
  RwReg   RELOAD;         /**< (TIMER Offset: 0x08) Reload Value */
  RwReg8  INTSTATUSCLEAR; /**< (TIMER Offset: 0x0C) Timer Interrupt, write 1 to clear */
  __I  uint8_t  Reserved2[4035];
  RoReg8  PID4;           /**< (TIMER Offset: 0xFD0) Peripheral ID Register 4 */
  __I  uint8_t  Reserved3[3];
  RoReg8  PID5;           /**< (TIMER Offset: 0xFD4) Peripheral ID Register 5 */
  __I  uint8_t  Reserved4[3];
  RoReg8  PID6;           /**< (TIMER Offset: 0xFD8) Peripheral ID Register 6 */
  __I  uint8_t  Reserved5[3];
  RoReg8  PID7;           /**< (TIMER Offset: 0xFDC) Peripheral ID Register 7 */
  __I  uint8_t  Reserved6[3];
  RoReg8  PID0;           /**< (TIMER Offset: 0xFE0) Peripheral ID Register 0 */
  __I  uint8_t  Reserved7[3];
  RoReg8  PID1;           /**< (TIMER Offset: 0xFE4) Peripheral ID Register 1 */
  __I  uint8_t  Reserved8[3];
  RoReg8  PID2;           /**< (TIMER Offset: 0xFE8) Peripheral ID Register 2 */
  __I  uint8_t  Reserved9[3];
  RoReg8  PID3;           /**< (TIMER Offset: 0xFEC) Peripheral ID Register 3 */
  __I  uint8_t  Reserved10[3];
  RoReg8  CID0;           /**< (TIMER Offset: 0xFF0) Component ID Register 0 */
  __I  uint8_t  Reserved11[3];
  RoReg8  CID1;           /**< (TIMER Offset: 0xFF4) Component ID Register 1 */
  __I  uint8_t  Reserved12[3];
  RoReg8  CID2;           /**< (TIMER Offset: 0xFF8) Component ID Register 2 */
  __I  uint8_t  Reserved13[3];
  RoReg8  CID3;           /**< (TIMER Offset: 0xFFC) Component ID Register 3 */
} Timer;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief TIMER hardware registers */
typedef struct {  /* ARM General Purpose Timer */
  __IO TIMER_CTRL_Type                CTRL;           /**< Offset: 0x00 (R/W   8) Timer Control */
       RoReg8                         Reserved1[0x3];
  __IO TIMER_VALUE_Type               VALUE;          /**< Offset: 0x04 (R/W  32) Current Value */
  __IO TIMER_RELOAD_Type              RELOAD;         /**< Offset: 0x08 (R/W  32) Reload Value */
  __IO TIMER_INTSTATUSCLEAR_Type      INTSTATUSCLEAR; /**< Offset: 0x0C (R/W   8) Timer Interrupt, write 1 to clear */
       RoReg8                         Reserved2[0xFC3];
  __I  TIMER_PID4_Type                PID4;           /**< Offset: 0xFD0 (R/    8) Peripheral ID Register 4 */
       RoReg8                         Reserved3[0x3];
  __I  TIMER_PID5_Type                PID5;           /**< Offset: 0xFD4 (R/    8) Peripheral ID Register 5 */
       RoReg8                         Reserved4[0x3];
  __I  TIMER_PID6_Type                PID6;           /**< Offset: 0xFD8 (R/    8) Peripheral ID Register 6 */
       RoReg8                         Reserved5[0x3];
  __I  TIMER_PID7_Type                PID7;           /**< Offset: 0xFDC (R/    8) Peripheral ID Register 7 */
       RoReg8                         Reserved6[0x3];
  __I  TIMER_PID0_Type                PID0;           /**< Offset: 0xFE0 (R/    8) Peripheral ID Register 0 */
       RoReg8                         Reserved7[0x3];
  __I  TIMER_PID1_Type                PID1;           /**< Offset: 0xFE4 (R/    8) Peripheral ID Register 1 */
       RoReg8                         Reserved8[0x3];
  __I  TIMER_PID2_Type                PID2;           /**< Offset: 0xFE8 (R/    8) Peripheral ID Register 2 */
       RoReg8                         Reserved9[0x3];
  __I  TIMER_PID3_Type                PID3;           /**< Offset: 0xFEC (R/    8) Peripheral ID Register 3 */
       RoReg8                         Reserved10[0x3];
  __I  TIMER_CID0_Type                CID0;           /**< Offset: 0xFF0 (R/    8) Component ID Register 0 */
       RoReg8                         Reserved11[0x3];
  __I  TIMER_CID1_Type                CID1;           /**< Offset: 0xFF4 (R/    8) Component ID Register 1 */
       RoReg8                         Reserved12[0x3];
  __I  TIMER_CID2_Type                CID2;           /**< Offset: 0xFF8 (R/    8) Component ID Register 2 */
       RoReg8                         Reserved13[0x3];
  __I  TIMER_CID3_Type                CID3;           /**< Offset: 0xFFC (R/    8) Component ID Register 3 */
} Timer;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_TIMER_COMPONENT_ */
